Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_config.c
/**********************************************************************************************************************
* Copyright (c) 2014 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
**********************************************************************************************************************/
/**********************************************************************************************************************
* System Name  : SDHI Driver
* File Name    : r_sdc_sd_config.c
* Version      : 3.01
* Device       : RX
* Abstract     : API & Sub module
* Tool-Chain   : For RX e2_studio
* OS           : not use
* H/W Platform : RSK board for RX
* Description  : Interface file for SDC SD API for RX
* Limitation   : None
**********************************************************************************************************************/
/**********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 31.07.2017 2.00    SDHI FIT module separated into hardware low level layer and middleware layer.
*              :                    Changed prefix from SDHI to SDC_SD.
*              : 29.06.2018 2.02    Corresponded to SD Specifications Part1 Physical Layer Simplified Specification.
*              : 10.02.2020 3.00    Added comment "WAIT_LOOP".
*                                   Fixed function names and return values.
*              : 20.03.2025 3.01    Changed the disclaimer in program sources.
**********************************************************************************************************************/

/**********************************************************************************************************************
Includes <System Includes> , "Project Includes"
**********************************************************************************************************************/
#include "r_sdc_sd_rx_if.h"
#include "r_sdhi_rx_if.h"
#include ".\src\r_sdc_sd_rx_private.h"

/**********************************************************************************************************************
Macro definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Typedef definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Private global variables and functions
**********************************************************************************************************************/
static sdhi_status_t r_sdc_sd_callback0(uint32_t sdsts1, uint32_t sdsts2);
static sdhi_status_t r_sdc_sd_dtc_callback0(void *);
static sdhi_status_t r_sdc_sdio_callback0(uint32_t sdiosts);
static sdhi_status_t r_sdc_sd_callback1(uint32_t sdsts1, uint32_t sdsts2);
static sdhi_status_t r_sdc_sd_dtc_callback1(void *);
static sdhi_status_t r_sdc_sdio_callback1(uint32_t sdiosts);

sdc_sd_hndl_t * g_sdc_sd_handle[SDC_SD_CFG_CARD_NUM];
uint32_t g_sdc_sd_int_dmacdtcflg[SDC_SD_CFG_CARD_NUM];

/**********************************************************************************************************************
* Outline      : Wait SD Card Interrupt
* Function Name: r_sdc_sd_int_wait
* Description  : Starts timer and waits for an interrupt generation.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : int32_t            time                ;   Timeout (msec).
* Return Value : SDC_SD_SUCCESS                         ;   Interrupt detection
*              : SDC_SD_ERR                             ;   Timeout
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_int_wait(uint32_t card_no, uint32_t time)
{
    sdc_sd_status_t    ret = SDC_SD_SUCCESS;

    if (r_sdc_sd_start_timer(card_no, time) == SDC_SD_ERR)
    {
        return SDC_SD_ERR;
    }

    /* WAIT_LOOP */
    while (1)
    {
        /* Get an interrupt generation. */
        if (r_sdc_sd_get_intstatus(card_no) == SDC_SD_SUCCESS)
        {
            ret = SDC_SD_SUCCESS;
            break;
        }

        /* Timeout? */
        if (r_sdc_sd_check_timer(card_no) == SDC_SD_ERR)
        {
            ret = SDC_SD_ERR;
            break;
        }
    }

    r_sdc_sd_end_timer(card_no);

    return ret;
} /* End of function r_sdc_sd_int_wait() */

/**********************************************************************************************************************
* Outline      : Wait SD Memory Card Interrupt
* Function Name: r_sdc_sd_int_mem_wait
* Description  : Starts timer and waits for an interrupt generation.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : int32_t            time                ;   Timeout (msec).
* Return Value : SDC_SD_SUCCESS                         ;   Interrupt detection
*              : SDC_SD_ERR                             ;   Timeout
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_int_mem_wait(uint32_t card_no, uint32_t time)
{
    sdc_sd_status_t    ret = SDC_SD_SUCCESS;

    if (r_sdc_sd_start_timer(card_no, time) == SDC_SD_ERR)
    {
        return SDC_SD_ERR;
    }

    /* WAIT_LOOP */
    while (1)
    {
        /* Get an interrupt generation. */
        if (r_sdc_sd_get_intstatus(card_no) == SDC_SD_SUCCESS)
        {
            ret = SDC_SD_SUCCESS;
            break;
        }

        /* Timeout? */
        if (r_sdc_sd_check_timer(card_no) == SDC_SD_ERR)
        {
            ret = SDC_SD_ERR;
            break;
        }
    }

    r_sdc_sd_end_timer(card_no);

    return ret;
} /* End of function r_sdc_sd_int_mem_wait() */

/**********************************************************************************************************************
* Outline      : Wait SDIO Card Interrupt
* Function Name: r_sdc_sd_int_io_wait
* Description  : Starts timer and waits for an interrupt generation.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : int32_t            time                ;   Timeout (msec).
*              : uint32_t           func                ;   Function No
* Return Value : SDC_SD_SUCCESS                         ;   Interrupt detection
*              : SDC_SD_ERR                             ;   Timeout
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_int_io_wait(uint32_t card_no, uint32_t time, uint32_t func)
{
    sdc_sd_status_t    ret = SDC_SD_SUCCESS;

    if (r_sdc_sd_start_timer(card_no, time) == SDC_SD_ERR)
    {
        return SDC_SD_ERR;
    }

    /* WAIT_LOOP */
    while (1)
    {
        /* Get an interrupt generation. */
        if (r_sdc_sd_get_intstatus(card_no) == SDC_SD_SUCCESS)
        {
            ret = SDC_SD_SUCCESS;
            break;
        }

        /* Timeout? */
        if (r_sdc_sd_check_timer(card_no) == SDC_SD_ERR)
        {
            ret = SDC_SD_ERR;
            break;
        }
    }

    r_sdc_sd_end_timer(card_no);

    return ret;
} /* End of function r_sdc_sd_int_io_wait() */

/**********************************************************************************************************************
* Outline      : Wait SD Memory Card Interrupt
* Function Name: r_sdc_sd_int_err_mem_wait
* Description  : Starts timer and waits for an interrupt generation.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : int32_t            time                ;   Timeout (msec).
* Return Value : SDC_SD_SUCCESS                         ;   Interrupt detection
*              : SDC_SD_ERR                             ;   Timeout
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_int_err_mem_wait(uint32_t card_no, uint32_t time)
{
    sdc_sd_status_t    ret = SDC_SD_SUCCESS;

    if (r_sdc_sd_start_timer(card_no, time) == SDC_SD_ERR)
    {
        return SDC_SD_ERR;
    }

    /* WAIT_LOOP */
    while (1)
    {
        /* Get an interrupt generation. */
        if (r_sdc_sd_get_intstatus(card_no) == SDC_SD_SUCCESS)
        {
            ret = SDC_SD_SUCCESS;
            break;
        }

        /* Timeout? */
        if (r_sdc_sd_check_timer(card_no) == SDC_SD_ERR)
        {
            ret = SDC_SD_ERR;
            break;
        }
    }

    r_sdc_sd_end_timer(card_no);

    return ret;
} /* End of function r_sdc_sd_int_err_mem_wait() */

/**********************************************************************************************************************
* Outline      : Wait SDIO Card Interrupt
* Function Name: r_sdc_sd_int_err_io_wait
* Description  : Starts timer and waits for an interrupt generation.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : int32_t            time                ;   Timeout (msec).
*              : uint32_t           func                ;   Function No
* Return Value : SDC_SD_SUCCESS                         ;   Interrupt detection
*              : SDC_SD_ERR                             ;   Timeout
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_int_err_io_wait(uint32_t card_no, uint32_t time, uint32_t func)
{
    sdc_sd_status_t    ret = SDC_SD_SUCCESS;

    if (r_sdc_sd_start_timer(card_no, time) == SDC_SD_ERR)
    {
        return SDC_SD_ERR;
    }

    /* WAIT_LOOP */
    while (1)
    {
        /* Get an interrupt generation. */
        if (r_sdc_sd_get_intstatus(card_no) == SDC_SD_SUCCESS)
        {
            ret = SDC_SD_SUCCESS;
            break;
        }

        /* Timeout? */
        if (r_sdc_sd_check_timer(card_no) == SDC_SD_ERR)
        {
            ret = SDC_SD_ERR;
            break;
        }
    }

    r_sdc_sd_end_timer(card_no);

    return ret;
} /* End of function r_sdc_sd_int_err_io_wait() */

/**********************************************************************************************************************
* Outline      : Wait
* Function Name: r_sdc_sd_wait
* Description  : Starts timer and waits.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : int32_t            time                ;   Timeout (msec).
* Return Value : SDC_SD_SUCCESS                         ;   Timeout
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_wait(uint32_t card_no, uint32_t time)
{
    if (r_sdc_sd_start_timer(card_no, time) == SDC_SD_ERR)
    {
        return SDC_SD_ERR;
    }

    /* WAIT_LOOP */
    while (1)
    {
        /* Timeout? */
        if (r_sdc_sd_check_timer(card_no) == SDC_SD_ERR)
        {
            break;
        }
    }

    r_sdc_sd_end_timer(card_no);

