Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_config.c
    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_wait() */

/**********************************************************************************************************************
* Outline      : Register SDHI FIT Module Callback Function
* Function Name: r_sdc_sd_set_int_callback
* Description  : Sets SDHI FIT module callback function.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           enable              ;   SDC_SD_CALLBACK_DISABLE
*              :                                        ;   SDC_SD_CALLBACK_ENABLE
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : Register the callback function for device number 0.
*              : User must create callback function registration process for device number 1 or later.
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_set_int_callback(uint32_t card_no, uint32_t enable)
{
    sdc_sd_hndl_t   * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    if (SDC_SD_CALLBACK_DISABLE == enable)
    {
        if (R_SDHI_IntCallback(p_hndl->channel, 0) != SDHI_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CONFIG, __LINE__);
            R_SDHI_IntCallback(p_hndl->channel, 0);
            return SDC_SD_ERR;
        }

        if (R_SDHI_IntSDBuffCallback(p_hndl->channel, 0) != SDHI_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CONFIG, __LINE__);
            R_SDHI_IntCallback(p_hndl->channel, 0);
            R_SDHI_IntSDBuffCallback(p_hndl->channel, 0);
            return SDC_SD_ERR;
        }

        if (R_SDHI_IntSdioCallback(p_hndl->channel, 0) != SDHI_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CONFIG, __LINE__);
            R_SDHI_IntCallback(p_hndl->channel, 0);
            R_SDHI_IntSDBuffCallback(p_hndl->channel, 0);
            R_SDHI_IntSdioCallback(p_hndl->channel, 0);
            return SDC_SD_ERR;
        }
    }
    else
    {
        if (SDC_SD_CARD_NO0 == card_no)
        {
            if (R_SDHI_IntCallback(p_hndl->channel, r_sdc_sd_callback0) != SDHI_SUCCESS)
            {
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CONFIG, __LINE__);
                R_SDHI_IntCallback(p_hndl->channel, 0);
                return SDC_SD_ERR;
            }

            if (R_SDHI_IntSDBuffCallback(p_hndl->channel, r_sdc_sd_dtc_callback0) != SDHI_SUCCESS)
            {
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CONFIG, __LINE__);
                R_SDHI_IntCallback(p_hndl->channel, 0);
                R_SDHI_IntSDBuffCallback(p_hndl->channel, 0);
                return SDC_SD_ERR;
            }

            if (R_SDHI_IntSdioCallback(p_hndl->channel, r_sdc_sdio_callback0) != SDHI_SUCCESS)
            {
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CONFIG, __LINE__);
                R_SDHI_IntCallback(p_hndl->channel, 0);
                R_SDHI_IntSDBuffCallback(p_hndl->channel, 0);
                R_SDHI_IntSdioCallback(p_hndl->channel, 0);
                return SDC_SD_ERR;
            }
        }
        else if (SDC_SD_CARD_NO1 == card_no)
        {
            if (R_SDHI_IntCallback(p_hndl->channel, r_sdc_sd_callback1) != SDHI_SUCCESS)
            {
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CONFIG, __LINE__);
                R_SDHI_IntCallback(p_hndl->channel, 0);
                return SDC_SD_ERR;
            }

            if (R_SDHI_IntSDBuffCallback(p_hndl->channel, r_sdc_sd_dtc_callback1) != SDHI_SUCCESS)
            {
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CONFIG, __LINE__);
                R_SDHI_IntCallback(p_hndl->channel, 0);
                R_SDHI_IntSDBuffCallback(p_hndl->channel, 0);
                return SDC_SD_ERR;
            }

            if (R_SDHI_IntSdioCallback(p_hndl->channel, r_sdc_sdio_callback1) != SDHI_SUCCESS)
            {
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CONFIG, __LINE__);
                R_SDHI_IntCallback(p_hndl->channel, 0);
                R_SDHI_IntSDBuffCallback(p_hndl->channel, 0);
                R_SDHI_IntSdioCallback(p_hndl->channel, 0);
                return SDC_SD_ERR;
            }
        }
        else
        {
            /* User must create callback function registration process for device number 1 or later. */
        }
    }

    return SDC_SD_SUCCESS;

} /* End of function r_sdc_sd_software_trans() */

/**********************************************************************************************************************
* Outline      : SDC Callback Processing
* Function Name: r_sdc_sd_callback0
* Description  : Executes the callback function of card access interrupt.
* Arguments    : uint32_t           sdsts1              ;   SDSTS1 register value
*              : uint32_t           sdsts2              ;   SDSTS2 register value
* Return Value : SDHI_SUCCESS                           ;   Successful operation
*              : SDHI_ERR                               ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : For device no 0.
**********************************************************************************************************************/
static sdhi_status_t r_sdc_sd_callback0(uint32_t sdsts1, uint32_t sdsts2)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    int32_t           cd = 0;

    p_hndl = SDC_SD_GET_HNDL(SDC_SD_CARD_NO0);  /* Card No. 0 */

#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (0 == p_hndl)
    {
        return SDHI_ERR;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

