Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_config.c
    if (r_sdc_sd_get_int(SDC_SD_CARD_NO0, sdsts1, sdsts2) == SDC_SD_SUCCESS)    /* Card No. 0 */
    {
        /* Check card detect interrupt. */
        if (p_hndl->sdsts1 & (SDHI_SDIMSK1_DET_DAT3 | SDHI_SDIMSK1_DET_CD))
        {
            if (p_hndl->sdc_sd_int_cd_callback)
            {
                if (p_hndl->sdsts1 & (SDHI_SDIMSK1_INS_DAT3 | SDHI_SDIMSK1_INS_CD))
                {
                    cd = SDC_SD_CD_INSERT; /* Insertion */
                }
                else
                {
                    cd = SDC_SD_CD_REMOVE; /* Removal */
                }
                (*p_hndl->sdc_sd_int_cd_callback)(cd);
            }
            p_hndl->sdsts1 = (p_hndl->sdsts1 & 
                             (uint32_t)~(SDHI_SDIMSK1_DET_DAT3 | SDHI_SDIMSK1_DET_CD));
        }
        if (p_hndl->sdsts1 || p_hndl->sdsts2)
        {
            if (p_hndl->sdc_sd_int_callback)
            {
                (*p_hndl->sdc_sd_int_callback)(0);
            }
        }
    }

    return SDHI_SUCCESS;
} /* End of function r_sdc_sd_callback0() */

/**********************************************************************************************************************
* Outline      : SDC SD Buffer Access Callback Processing
* Function Name: r_sdc_sd_dtc_callback0
* Description  : Executes the callback function of SD buffer access interrupt.
* Arguments    : uint32_t           sdsts1              ;   SDSTS1 register value
*              : uint32_t           sdsts2              ;   SDSTS2 register value
* Return Value : SDHI_SUCCESS                           ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : For device no 0.
**********************************************************************************************************************/
static sdhi_status_t r_sdc_sd_dtc_callback0(void * vect)
{
    R_SDC_SD_SetDmacDtcTransFlg(SDC_SD_CARD_NO0, SDC_SD_SET_TRANS_STOP);  /* Card No. 0 */

    return SDHI_SUCCESS;
} /* End of function r_sdc_sd_dtc_callback0() */

/**********************************************************************************************************************
* Outline      : SDHI SDIO Callback Processing
* Function Name: r_sdc_sdio_callback0
* Description  : Executes the callback function of SDIO interrupt.
* Arguments    : uint32_t           sdiosts             ;   SDIOSTS register value.
* Return Value : SDHI_SUCCESS                           ;   Successful operation
*              : SDHI_ERR                               ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : For device no 0.
**********************************************************************************************************************/
static sdhi_status_t r_sdc_sdio_callback0(uint32_t sdiosts)
{
    sdc_sd_hndl_t   * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(SDC_SD_CARD_NO0);  /* Card No. 0 */

#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (0 == p_hndl)
    {
        return SDHI_ERR;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
    if (r_sdc_sdio_get_int(SDC_SD_CARD_NO0, sdiosts) == SDC_SD_SUCCESS)     /* Card No. 0 */
    {
        if (p_hndl->sdc_sd_int_io_callback)
        {
            (*p_hndl->sdc_sd_int_io_callback)(0);
        }
    }
#endif /* SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO */

    return SDHI_SUCCESS;
} /* End of function r_sdc_sdio_callback0() */

/**********************************************************************************************************************
* Outline      : SDC Callback Processing
* Function Name: r_sdc_sd_callback1
* Description  : Executes the callback function of card access interrupt.
* Arguments    : uint32_t           sdsts1              ;   SDSTS1 register value
*              : uint32_t           sdsts2              ;   SDSTS2 register value
* Return Value : SDHI_SUCCESS                           ;   Successful operation
*              : SDHI_ERR                               ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : For device no 1.
**********************************************************************************************************************/
static sdhi_status_t r_sdc_sd_callback1(uint32_t sdsts1, uint32_t sdsts2)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    int32_t           cd = 0;

    p_hndl = SDC_SD_GET_HNDL(SDC_SD_CARD_NO1);  /* Card No. 1 */

#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (0 == p_hndl)
    {
        return SDHI_ERR;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    if (r_sdc_sd_get_int(SDC_SD_CARD_NO1, sdsts1, sdsts2) == SDC_SD_SUCCESS)    /* Card No. 1 */
    {
        /* Check card detect interrupt. */
        if (p_hndl->sdsts1 & (SDHI_SDIMSK1_DET_DAT3 | SDHI_SDIMSK1_DET_CD))
        {
            if (p_hndl->sdc_sd_int_cd_callback)
            {
                if (p_hndl->sdsts1 & (SDHI_SDIMSK1_INS_DAT3 | SDHI_SDIMSK1_INS_CD))
                {
                    cd = SDC_SD_CD_INSERT; /* Insertion */
                }
                else
                {
                    cd = SDC_SD_CD_REMOVE; /* Removal */
                }
                (*p_hndl->sdc_sd_int_cd_callback)(cd);
            }
            p_hndl->sdsts1 = (p_hndl->sdsts1 & 
                             (uint32_t)~(SDHI_SDIMSK1_DET_DAT3 | SDHI_SDIMSK1_DET_CD));
        }
        if (p_hndl->sdsts1 || p_hndl->sdsts2)
        {
            if (p_hndl->sdc_sd_int_callback)
            {
                (*p_hndl->sdc_sd_int_callback)(0);
            }
        }
    }

    return SDHI_SUCCESS;
} /* End of function r_sdc_sd_callback1() */

/**********************************************************************************************************************
* Outline      : SDC SD Buffer Access Callback Processing
* Function Name: r_sdc_sd_dtc_callback1
* Description  : Executes the callback function of SD buffer access interrupt.
* Arguments    : uint32_t           sdsts1              ;   SDSTS1 register value
*              : uint32_t           sdsts2              ;   SDSTS2 register value
* Return Value : SDHI_SUCCESS                           ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : For device no 1.
**********************************************************************************************************************/
static sdhi_status_t r_sdc_sd_dtc_callback1(void * vect)
{
    R_SDC_SD_SetDmacDtcTransFlg(SDC_SD_CARD_NO1, SDC_SD_SET_TRANS_STOP);  /* Card No. 1 */

    return SDHI_SUCCESS;
} /* End of function r_sdc_sd_dtc_callback1() */

/**********************************************************************************************************************
* Outline      : SDHI SDIO Callback Processing
* Function Name: r_sdc_sdio_callback1
* Description  : Executes the callback function of SDIO interrupt.
* Arguments    : uint32_t           sdiosts             ;   SDIOSTS register value.
* Return Value : SDHI_SUCCESS                           ;   Successful operation
*              : SDHI_ERR                               ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : For device no 1.
**********************************************************************************************************************/
static sdhi_status_t r_sdc_sdio_callback1(uint32_t sdiosts)
{
    sdc_sd_hndl_t   * p_hndl = 0;

